Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1150/periph/PERI_ENET_QOS.h
/*! @name MAC_PACKET_FILTER - MAC Packet Filter */
/*! @{ */

#define ENET_QOS_MAC_PACKET_FILTER_PR_MASK       (0x1U)
#define ENET_QOS_MAC_PACKET_FILTER_PR_SHIFT      (0U)
/*! PR - Promiscuous Mode
 *  0b0..Promiscuous Mode is disabled
 *  0b1..Promiscuous Mode is enabled
 */
#define ENET_QOS_MAC_PACKET_FILTER_PR(x)         (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_PACKET_FILTER_PR_SHIFT)) & ENET_QOS_MAC_PACKET_FILTER_PR_MASK)

#define ENET_QOS_MAC_PACKET_FILTER_HUC_MASK      (0x2U)
#define ENET_QOS_MAC_PACKET_FILTER_HUC_SHIFT     (1U)
/*! HUC - Hash Unicast
 *  0b0..Hash Unicast is disabled
 *  0b1..Hash Unicast is enabled
 */
#define ENET_QOS_MAC_PACKET_FILTER_HUC(x)        (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_PACKET_FILTER_HUC_SHIFT)) & ENET_QOS_MAC_PACKET_FILTER_HUC_MASK)

#define ENET_QOS_MAC_PACKET_FILTER_HMC_MASK      (0x4U)
#define ENET_QOS_MAC_PACKET_FILTER_HMC_SHIFT     (2U)
/*! HMC - Hash Multicast
 *  0b0..Hash Multicast is disabled
 *  0b1..Hash Multicast is enabled
 */
#define ENET_QOS_MAC_PACKET_FILTER_HMC(x)        (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_PACKET_FILTER_HMC_SHIFT)) & ENET_QOS_MAC_PACKET_FILTER_HMC_MASK)

#define ENET_QOS_MAC_PACKET_FILTER_DAIF_MASK     (0x8U)
#define ENET_QOS_MAC_PACKET_FILTER_DAIF_SHIFT    (3U)
/*! DAIF - DA Inverse Filtering
 *  0b0..DA Inverse Filtering is disabled
 *  0b1..DA Inverse Filtering is enabled
 */
#define ENET_QOS_MAC_PACKET_FILTER_DAIF(x)       (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_PACKET_FILTER_DAIF_SHIFT)) & ENET_QOS_MAC_PACKET_FILTER_DAIF_MASK)

#define ENET_QOS_MAC_PACKET_FILTER_PM_MASK       (0x10U)
#define ENET_QOS_MAC_PACKET_FILTER_PM_SHIFT      (4U)
/*! PM - Pass All Multicast
 *  0b0..Pass All Multicast is disabled
 *  0b1..Pass All Multicast is enabled
 */
#define ENET_QOS_MAC_PACKET_FILTER_PM(x)         (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_PACKET_FILTER_PM_SHIFT)) & ENET_QOS_MAC_PACKET_FILTER_PM_MASK)

#define ENET_QOS_MAC_PACKET_FILTER_DBF_MASK      (0x20U)
#define ENET_QOS_MAC_PACKET_FILTER_DBF_SHIFT     (5U)
/*! DBF - Disable Broadcast Packets
 *  0b0..Enable Broadcast Packets
 *  0b1..Disable Broadcast Packets
 */
#define ENET_QOS_MAC_PACKET_FILTER_DBF(x)        (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_PACKET_FILTER_DBF_SHIFT)) & ENET_QOS_MAC_PACKET_FILTER_DBF_MASK)

#define ENET_QOS_MAC_PACKET_FILTER_PCF_MASK      (0xC0U)
#define ENET_QOS_MAC_PACKET_FILTER_PCF_SHIFT     (6U)
/*! PCF - Pass Control Packets These bits control the forwarding of all control packets (including
 *    unicast and multicast Pause packets).
 *  0b00..MAC filters all control packets from reaching the application
 *  0b01..MAC forwards all control packets except Pause packets to the application even if they fail the Address filter
 *  0b10..MAC forwards all control packets to the application even if they fail the Address filter
 *  0b11..MAC forwards the control packets that pass the Address filter
 */
#define ENET_QOS_MAC_PACKET_FILTER_PCF(x)        (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_PACKET_FILTER_PCF_SHIFT)) & ENET_QOS_MAC_PACKET_FILTER_PCF_MASK)

#define ENET_QOS_MAC_PACKET_FILTER_SAIF_MASK     (0x100U)
#define ENET_QOS_MAC_PACKET_FILTER_SAIF_SHIFT    (8U)
/*! SAIF - SA Inverse Filtering
 *  0b0..SA Inverse Filtering is disabled
 *  0b1..SA Inverse Filtering is enabled
 */
#define ENET_QOS_MAC_PACKET_FILTER_SAIF(x)       (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_PACKET_FILTER_SAIF_SHIFT)) & ENET_QOS_MAC_PACKET_FILTER_SAIF_MASK)

#define ENET_QOS_MAC_PACKET_FILTER_SAF_MASK      (0x200U)
#define ENET_QOS_MAC_PACKET_FILTER_SAF_SHIFT     (9U)
/*! SAF - Source Address Filter Enable
 *  0b0..SA Filtering is disabled
 *  0b1..SA Filtering is enabled
 */
#define ENET_QOS_MAC_PACKET_FILTER_SAF(x)        (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_PACKET_FILTER_SAF_SHIFT)) & ENET_QOS_MAC_PACKET_FILTER_SAF_MASK)

#define ENET_QOS_MAC_PACKET_FILTER_HPF_MASK      (0x400U)
#define ENET_QOS_MAC_PACKET_FILTER_HPF_SHIFT     (10U)
/*! HPF - Hash or Perfect Filter
 *  0b0..Hash or Perfect Filter is disabled
 *  0b1..Hash or Perfect Filter is enabled
 */
#define ENET_QOS_MAC_PACKET_FILTER_HPF(x)        (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_PACKET_FILTER_HPF_SHIFT)) & ENET_QOS_MAC_PACKET_FILTER_HPF_MASK)

#define ENET_QOS_MAC_PACKET_FILTER_VTFE_MASK     (0x10000U)
#define ENET_QOS_MAC_PACKET_FILTER_VTFE_SHIFT    (16U)
/*! VTFE - VLAN Tag Filter Enable
 *  0b0..VLAN Tag Filter is disabled
 *  0b1..VLAN Tag Filter is enabled
 */
#define ENET_QOS_MAC_PACKET_FILTER_VTFE(x)       (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_PACKET_FILTER_VTFE_SHIFT)) & ENET_QOS_MAC_PACKET_FILTER_VTFE_MASK)

#define ENET_QOS_MAC_PACKET_FILTER_IPFE_MASK     (0x100000U)
#define ENET_QOS_MAC_PACKET_FILTER_IPFE_SHIFT    (20U)
/*! IPFE - Layer 3 and Layer 4 Filter Enable
 *  0b0..Layer 3 and Layer 4 Filters are disabled
 *  0b1..Layer 3 and Layer 4 Filters are enabled
 */
#define ENET_QOS_MAC_PACKET_FILTER_IPFE(x)       (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_PACKET_FILTER_IPFE_SHIFT)) & ENET_QOS_MAC_PACKET_FILTER_IPFE_MASK)

#define ENET_QOS_MAC_PACKET_FILTER_DNTU_MASK     (0x200000U)
#define ENET_QOS_MAC_PACKET_FILTER_DNTU_SHIFT    (21U)
/*! DNTU - Drop Non-TCP/UDP over IP Packets
 *  0b0..Forward Non-TCP/UDP over IP Packets
 *  0b1..Drop Non-TCP/UDP over IP Packets
 */
#define ENET_QOS_MAC_PACKET_FILTER_DNTU(x)       (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_PACKET_FILTER_DNTU_SHIFT)) & ENET_QOS_MAC_PACKET_FILTER_DNTU_MASK)

#define ENET_QOS_MAC_PACKET_FILTER_RA_MASK       (0x80000000U)
#define ENET_QOS_MAC_PACKET_FILTER_RA_SHIFT      (31U)
/*! RA - Receive All
 *  0b0..Receive All is disabled
 *  0b1..Receive All is enabled
 */
#define ENET_QOS_MAC_PACKET_FILTER_RA(x)         (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_PACKET_FILTER_RA_SHIFT)) & ENET_QOS_MAC_PACKET_FILTER_RA_MASK)
/*! @} */

/*! @name MAC_WATCHDOG_TIMEOUT - Watchdog Timeout */
/*! @{ */

#define ENET_QOS_MAC_WATCHDOG_TIMEOUT_WTO_MASK   (0xFU)
#define ENET_QOS_MAC_WATCHDOG_TIMEOUT_WTO_SHIFT  (0U)
/*! WTO - Watchdog Timeout
 *  0b0000..2 KB
 *  0b0001..3 KB
 *  0b0010..4 KB
 *  0b0011..5 KB
 *  0b0100..6 KB
 *  0b0101..7 KB
 *  0b0110..8 KB
 *  0b0111..9 KB
 *  0b1000..10 KB
 *  0b1001..11 KB
 *  0b1010..12 KB
 *  0b1011..13 KB
 *  0b1100..14 KB
 *  0b1101..15 KB
 *  0b1110..16383 Bytes
 *  0b1111..Reserved
 */
#define ENET_QOS_MAC_WATCHDOG_TIMEOUT_WTO(x)     (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_WATCHDOG_TIMEOUT_WTO_SHIFT)) & ENET_QOS_MAC_WATCHDOG_TIMEOUT_WTO_MASK)

