Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1150/periph/PERI_ENET_QOS.h
#define ENET_QOS_MAC_INTERRUPT_ENABLE_MDIOIE_MASK (0x40000U)
#define ENET_QOS_MAC_INTERRUPT_ENABLE_MDIOIE_SHIFT (18U)
/*! MDIOIE - MDIO Interrupt Enable When this bit is set, it enables the assertion of the interrupt
 *    when MDIOIS field is set in the MAC_INTERRUPT_STATUS register.
 *  0b0..MDIO Interrupt is disabled
 *  0b1..MDIO Interrupt is enabled
 */
#define ENET_QOS_MAC_INTERRUPT_ENABLE_MDIOIE(x)  (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_INTERRUPT_ENABLE_MDIOIE_SHIFT)) & ENET_QOS_MAC_INTERRUPT_ENABLE_MDIOIE_MASK)
/*! @} */

/*! @name MAC_RX_TX_STATUS - Receive Transmit Status */
/*! @{ */

#define ENET_QOS_MAC_RX_TX_STATUS_TJT_MASK       (0x1U)
#define ENET_QOS_MAC_RX_TX_STATUS_TJT_SHIFT      (0U)
/*! TJT - Transmit Jabber Timeout This bit indicates that the Transmit Jabber Timer expired which
 *    happens when the packet size exceeds 2,048 bytes (10,240 bytes when the Jumbo packet is enabled)
 *    and JD bit is reset in the MAC_CONFIGURATION register.
 *  0b0..No Transmit Jabber Timeout
 *  0b1..Transmit Jabber Timeout occurred
 */
#define ENET_QOS_MAC_RX_TX_STATUS_TJT(x)         (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_RX_TX_STATUS_TJT_SHIFT)) & ENET_QOS_MAC_RX_TX_STATUS_TJT_MASK)

#define ENET_QOS_MAC_RX_TX_STATUS_NCARR_MASK     (0x2U)
#define ENET_QOS_MAC_RX_TX_STATUS_NCARR_SHIFT    (1U)
/*! NCARR - No Carrier When the DTXSTS bit is set in the MAC_OPERATION_MODE register, this bit
 *    indicates that the carrier signal from the PHY is not present at the end of preamble transmission.
 *  0b0..Carrier is present
 *  0b1..No carrier
 */
#define ENET_QOS_MAC_RX_TX_STATUS_NCARR(x)       (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_RX_TX_STATUS_NCARR_SHIFT)) & ENET_QOS_MAC_RX_TX_STATUS_NCARR_MASK)

#define ENET_QOS_MAC_RX_TX_STATUS_LCARR_MASK     (0x4U)
#define ENET_QOS_MAC_RX_TX_STATUS_LCARR_SHIFT    (2U)
/*! LCARR - Loss of Carrier When the DTXSTS bit is set in the MAC_OPERATION_MODE register, this bit
 *    indicates that the loss of carrier occurred during packet transmission, that is, the phy_crs_i
 *    signal was inactive for one or more transmission clock periods during packet transmission.
 *  0b0..Carrier is present
 *  0b1..Loss of carrier
 */
#define ENET_QOS_MAC_RX_TX_STATUS_LCARR(x)       (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_RX_TX_STATUS_LCARR_SHIFT)) & ENET_QOS_MAC_RX_TX_STATUS_LCARR_MASK)

#define ENET_QOS_MAC_RX_TX_STATUS_EXDEF_MASK     (0x8U)
#define ENET_QOS_MAC_RX_TX_STATUS_EXDEF_SHIFT    (3U)
/*! EXDEF - Excessive Deferral When the DTXSTS bit is set in the MAC_OPERATION_MODE register and the
 *    DC bit is set in the MAC_CONFIGURATION register, this bit indicates that the transmission
 *    ended because of excessive deferral of over 24,288 bit times (155,680 in 1000/2500 Mbps mode or
 *    when Jumbo packet is enabled).
 *  0b0..No Excessive deferral
 *  0b1..Excessive deferral
 */
#define ENET_QOS_MAC_RX_TX_STATUS_EXDEF(x)       (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_RX_TX_STATUS_EXDEF_SHIFT)) & ENET_QOS_MAC_RX_TX_STATUS_EXDEF_MASK)

#define ENET_QOS_MAC_RX_TX_STATUS_LCOL_MASK      (0x10U)
#define ENET_QOS_MAC_RX_TX_STATUS_LCOL_SHIFT     (4U)
/*! LCOL - Late Collision When the DTXSTS bit is set in the MAC_OPERATION_MODE register, this bit
 *    indicates that the packet transmission aborted because a collision occurred after the collision
 *    window (64 bytes including Preamble in MII mode; 512 bytes including Preamble and Carrier
 *    Extension in GMII mode).
 *  0b0..No collision
 *  0b1..Late collision is sensed
 */
#define ENET_QOS_MAC_RX_TX_STATUS_LCOL(x)        (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_RX_TX_STATUS_LCOL_SHIFT)) & ENET_QOS_MAC_RX_TX_STATUS_LCOL_MASK)

#define ENET_QOS_MAC_RX_TX_STATUS_EXCOL_MASK     (0x20U)
#define ENET_QOS_MAC_RX_TX_STATUS_EXCOL_SHIFT    (5U)
/*! EXCOL - Excessive Collisions When the DTXSTS bit is set in the MAC_OPERATION_MODE register, this
 *    bit indicates that the transmission aborted after 16 successive collisions while attempting
 *    to transmit the current packet.
 *  0b0..No collision
 *  0b1..Excessive collision is sensed
 */
#define ENET_QOS_MAC_RX_TX_STATUS_EXCOL(x)       (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_RX_TX_STATUS_EXCOL_SHIFT)) & ENET_QOS_MAC_RX_TX_STATUS_EXCOL_MASK)

#define ENET_QOS_MAC_RX_TX_STATUS_RWT_MASK       (0x100U)
#define ENET_QOS_MAC_RX_TX_STATUS_RWT_SHIFT      (8U)
/*! RWT - Receive Watchdog Timeout This bit is set when a packet with length greater than 2,048
 *    bytes is received (10, 240 bytes when Jumbo Packet mode is enabled) and the WD bit is reset in the
 *    MAC_CONFIGURATION register.
 *  0b0..No receive watchdog timeout
 *  0b1..Receive watchdog timed out
 */
#define ENET_QOS_MAC_RX_TX_STATUS_RWT(x)         (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_RX_TX_STATUS_RWT_SHIFT)) & ENET_QOS_MAC_RX_TX_STATUS_RWT_MASK)
/*! @} */

/*! @name MAC_PMT_CONTROL_STATUS - PMT Control and Status */
/*! @{ */

#define ENET_QOS_MAC_PMT_CONTROL_STATUS_PWRDWN_MASK (0x1U)
#define ENET_QOS_MAC_PMT_CONTROL_STATUS_PWRDWN_SHIFT (0U)
/*! PWRDWN - Power Down When this bit is set, the MAC receiver drops all received packets until it
 *    receives the expected magic packet or remote wake-up packet.
 *  0b0..Power down is disabled
 *  0b1..Power down is enabled
 */
#define ENET_QOS_MAC_PMT_CONTROL_STATUS_PWRDWN(x) (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_PMT_CONTROL_STATUS_PWRDWN_SHIFT)) & ENET_QOS_MAC_PMT_CONTROL_STATUS_PWRDWN_MASK)

#define ENET_QOS_MAC_PMT_CONTROL_STATUS_MGKPKTEN_MASK (0x2U)
#define ENET_QOS_MAC_PMT_CONTROL_STATUS_MGKPKTEN_SHIFT (1U)
/*! MGKPKTEN - Magic Packet Enable When this bit is set, a power management event is generated when the MAC receives a magic packet.
 *  0b0..Magic Packet is disabled
 *  0b1..Magic Packet is enabled
 */
#define ENET_QOS_MAC_PMT_CONTROL_STATUS_MGKPKTEN(x) (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_PMT_CONTROL_STATUS_MGKPKTEN_SHIFT)) & ENET_QOS_MAC_PMT_CONTROL_STATUS_MGKPKTEN_MASK)

#define ENET_QOS_MAC_PMT_CONTROL_STATUS_RWKPKTEN_MASK (0x4U)
#define ENET_QOS_MAC_PMT_CONTROL_STATUS_RWKPKTEN_SHIFT (2U)
/*! RWKPKTEN - Remote Wake-Up Packet Enable When this bit is set, a power management event is
 *    generated when the MAC receives a remote wake-up packet.
 *  0b0..Remote wake-up packet is disabled
 *  0b1..Remote wake-up packet is enabled
 */
#define ENET_QOS_MAC_PMT_CONTROL_STATUS_RWKPKTEN(x) (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_PMT_CONTROL_STATUS_RWKPKTEN_SHIFT)) & ENET_QOS_MAC_PMT_CONTROL_STATUS_RWKPKTEN_MASK)

#define ENET_QOS_MAC_PMT_CONTROL_STATUS_MGKPRCVD_MASK (0x20U)
#define ENET_QOS_MAC_PMT_CONTROL_STATUS_MGKPRCVD_SHIFT (5U)
/*! MGKPRCVD - Magic Packet Received When this bit is set, it indicates that the power management
 *    event is generated because of the reception of a magic packet.
 *  0b0..No Magic packet is received
 *  0b1..Magic packet is received
 */
#define ENET_QOS_MAC_PMT_CONTROL_STATUS_MGKPRCVD(x) (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_PMT_CONTROL_STATUS_MGKPRCVD_SHIFT)) & ENET_QOS_MAC_PMT_CONTROL_STATUS_MGKPRCVD_MASK)

