Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1150/periph/PERI_ENET_QOS.h
#define ENET_QOS_MAC_HW_FEAT_ADDR64_MASK         (0xC000U)
#define ENET_QOS_MAC_HW_FEAT_ADDR64_SHIFT        (14U)
/*! ADDR64 - Address Width.
 *  0b00..32
 *  0b01..40
 *  0b10..48
 *  0b11..Reserved
 */
#define ENET_QOS_MAC_HW_FEAT_ADDR64(x)           (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_ADDR64_SHIFT)) & ENET_QOS_MAC_HW_FEAT_ADDR64_MASK)

#define ENET_QOS_MAC_HW_FEAT_TXCOESEL_MASK       (0x4000U)
#define ENET_QOS_MAC_HW_FEAT_TXCOESEL_SHIFT      (14U)
/*! TXCOESEL - Transmit Checksum Offload Enabled This bit is set to 1 when the Enable Transmit
 *    TCP/IP Checksum Insertion option is selected
 *  0b0..Transmit Checksum Offload Enable option is not selected
 *  0b1..Transmit Checksum Offload Enable option is selected
 */
#define ENET_QOS_MAC_HW_FEAT_TXCOESEL(x)         (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_TXCOESEL_SHIFT)) & ENET_QOS_MAC_HW_FEAT_TXCOESEL_MASK)

#define ENET_QOS_MAC_HW_FEAT_DCBEN_MASK          (0x10000U)
#define ENET_QOS_MAC_HW_FEAT_DCBEN_SHIFT         (16U)
/*! DCBEN - DCB Feature Enable This bit is set to 1 when the Enable Data Center Bridging option is selected
 *  0b0..DCB Feature is not selected
 *  0b1..DCB Feature is selected
 */
#define ENET_QOS_MAC_HW_FEAT_DCBEN(x)            (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_DCBEN_SHIFT)) & ENET_QOS_MAC_HW_FEAT_DCBEN_MASK)

#define ENET_QOS_MAC_HW_FEAT_ESTSEL_MASK         (0x10000U)
#define ENET_QOS_MAC_HW_FEAT_ESTSEL_SHIFT        (16U)
/*! ESTSEL - Enhancements to Scheduling Traffic Enable This bit is set to 1 when the Enable
 *    Enhancements to Scheduling Traffic feature is selected.
 *  0b0..Enable Enhancements to Scheduling Traffic feature is not selected
 *  0b1..Enable Enhancements to Scheduling Traffic feature is selected
 */
#define ENET_QOS_MAC_HW_FEAT_ESTSEL(x)           (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_ESTSEL_SHIFT)) & ENET_QOS_MAC_HW_FEAT_ESTSEL_MASK)

#define ENET_QOS_MAC_HW_FEAT_RXCOESEL_MASK       (0x10000U)
#define ENET_QOS_MAC_HW_FEAT_RXCOESEL_SHIFT      (16U)
/*! RXCOESEL - Receive Checksum Offload Enabled This bit is set to 1 when the Enable Receive TCP/IP Checksum Check option is selected
 *  0b0..Receive Checksum Offload Enable option is not selected
 *  0b1..Receive Checksum Offload Enable option is selected
 */
#define ENET_QOS_MAC_HW_FEAT_RXCOESEL(x)         (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_RXCOESEL_SHIFT)) & ENET_QOS_MAC_HW_FEAT_RXCOESEL_MASK)

#define ENET_QOS_MAC_HW_FEAT_ESTDEP_MASK         (0xE0000U)
#define ENET_QOS_MAC_HW_FEAT_ESTDEP_SHIFT        (17U)
/*! ESTDEP - Depth of the Gate Control List This field indicates the depth of Gate Control list expressed as Log2(DWC_EQOS_EST_DEP)-5
 *  0b000..No Depth configured
 *  0b001..64
 *  0b010..128
 *  0b011..256
 *  0b100..512
 *  0b101..1024
 *  0b110..Reserved
 */
#define ENET_QOS_MAC_HW_FEAT_ESTDEP(x)           (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_ESTDEP_SHIFT)) & ENET_QOS_MAC_HW_FEAT_ESTDEP_MASK)

#define ENET_QOS_MAC_HW_FEAT_SPHEN_MASK          (0x20000U)
#define ENET_QOS_MAC_HW_FEAT_SPHEN_SHIFT         (17U)
/*! SPHEN - Split Header Feature Enable This bit is set to 1 when the Enable Split Header Structure option is selected
 *  0b0..Split Header Feature is not selected
 *  0b1..Split Header Feature is selected
 */
#define ENET_QOS_MAC_HW_FEAT_SPHEN(x)            (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_SPHEN_SHIFT)) & ENET_QOS_MAC_HW_FEAT_SPHEN_MASK)

#define ENET_QOS_MAC_HW_FEAT_ADDMACADRSEL_MASK   (0x7C0000U)
#define ENET_QOS_MAC_HW_FEAT_ADDMACADRSEL_SHIFT  (18U)
/*! ADDMACADRSEL - MAC Addresses 1-31 Selected This bit is set to 1 when the non-zero value is
 *    selected for Enable Additional 1-31 MAC Address Registers option
 */
#define ENET_QOS_MAC_HW_FEAT_ADDMACADRSEL(x)     (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_ADDMACADRSEL_SHIFT)) & ENET_QOS_MAC_HW_FEAT_ADDMACADRSEL_MASK)

#define ENET_QOS_MAC_HW_FEAT_TSOEN_MASK          (0x40000U)
#define ENET_QOS_MAC_HW_FEAT_TSOEN_SHIFT         (18U)
/*! TSOEN - TCP Segmentation Offload Enable This bit is set to 1 when the Enable TCP Segmentation
 *    Offloading for TCP/IP Packets option is selected
 *  0b0..TCP Segmentation Offload Feature is not selected
 *  0b1..TCP Segmentation Offload Feature is selected
 */
#define ENET_QOS_MAC_HW_FEAT_TSOEN(x)            (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_TSOEN_SHIFT)) & ENET_QOS_MAC_HW_FEAT_TSOEN_MASK)

#define ENET_QOS_MAC_HW_FEAT_TXCHCNT_MASK        (0x3C0000U)
#define ENET_QOS_MAC_HW_FEAT_TXCHCNT_SHIFT       (18U)
/*! TXCHCNT - Number of DMA Transmit Channels This field indicates the number of DMA Transmit channels:
 *  0b0000..1 MTL Tx Channel
 *  0b0001..2 MTL Tx Channels
 *  0b0010..3 MTL Tx Channels
 *  0b0011..4 MTL Tx Channels
 *  0b0100..5 MTL Tx Channels
 *  0b0101..Reserved
 *  0b0110..Reserved
 *  0b0111..Reserved
 */
#define ENET_QOS_MAC_HW_FEAT_TXCHCNT(x)          (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_TXCHCNT_SHIFT)) & ENET_QOS_MAC_HW_FEAT_TXCHCNT_MASK)

#define ENET_QOS_MAC_HW_FEAT_DBGMEMA_MASK        (0x80000U)
#define ENET_QOS_MAC_HW_FEAT_DBGMEMA_SHIFT       (19U)
/*! DBGMEMA - DMA Debug Registers Enable This bit is set to 1 when the Debug Mode Enable option is selected
 *  0b0..DMA Debug Registers option is not selected
 *  0b1..DMA Debug Registers option is selected
 */
#define ENET_QOS_MAC_HW_FEAT_DBGMEMA(x)          (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_DBGMEMA_SHIFT)) & ENET_QOS_MAC_HW_FEAT_DBGMEMA_MASK)

#define ENET_QOS_MAC_HW_FEAT_AVSEL_MASK          (0x100000U)
#define ENET_QOS_MAC_HW_FEAT_AVSEL_SHIFT         (20U)
/*! AVSEL - AV Feature Enable This bit is set to 1 when the Enable Audio Video Bridging option is selected.
 *  0b0..AV Feature is not selected
 *  0b1..AV Feature is selected
 */
#define ENET_QOS_MAC_HW_FEAT_AVSEL(x)            (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_AVSEL_SHIFT)) & ENET_QOS_MAC_HW_FEAT_AVSEL_MASK)

#define ENET_QOS_MAC_HW_FEAT_ESTWID_MASK         (0x300000U)
#define ENET_QOS_MAC_HW_FEAT_ESTWID_SHIFT        (20U)
/*! ESTWID - Width of the Time Interval field in the Gate Control List This field indicates the
 *    width of the Configured Time Interval Field
 *  0b00..Width not configured
 *  0b01..16
 *  0b10..20
 *  0b11..24
 */
#define ENET_QOS_MAC_HW_FEAT_ESTWID(x)           (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_ESTWID_SHIFT)) & ENET_QOS_MAC_HW_FEAT_ESTWID_MASK)

#define ENET_QOS_MAC_HW_FEAT_RAVSEL_MASK         (0x200000U)
#define ENET_QOS_MAC_HW_FEAT_RAVSEL_SHIFT        (21U)
/*! RAVSEL - Rx Side Only AV Feature Enable This bit is set to 1 when the Enable Audio Video
 *    Bridging option on Rx Side Only is selected.
 *  0b0..Rx Side Only AV Feature is not selected
 *  0b1..Rx Side Only AV Feature is selected
 */
#define ENET_QOS_MAC_HW_FEAT_RAVSEL(x)           (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_RAVSEL_SHIFT)) & ENET_QOS_MAC_HW_FEAT_RAVSEL_MASK)

