Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1150/periph/PERI_ENET_QOS.h
#define ENET_QOS_MTL_EST_STATUS_SWOL_MASK        (0x80U)
#define ENET_QOS_MTL_EST_STATUS_SWOL_SHIFT       (7U)
/*! SWOL - S/W owned list When '0' indicates Gate control list number "0" is owned by software and
 *    when "1" indicates the Gate Control list "1" is owned by the software.
 *  0b0..Gate control list number "0" is owned by software
 *  0b1..Gate control list number "1" is owned by software
 */
#define ENET_QOS_MTL_EST_STATUS_SWOL(x)          (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_EST_STATUS_SWOL_SHIFT)) & ENET_QOS_MTL_EST_STATUS_SWOL_MASK)

#define ENET_QOS_MTL_EST_STATUS_BTRL_MASK        (0xF00U)
#define ENET_QOS_MTL_EST_STATUS_BTRL_SHIFT       (8U)
/*! BTRL - BTR Error Loop Count Provides the minimum count (N) for which the equation Current Time
 *    =< New BTR + (N * New Cycle Time) becomes true.
 */
#define ENET_QOS_MTL_EST_STATUS_BTRL(x)          (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_EST_STATUS_BTRL_SHIFT)) & ENET_QOS_MTL_EST_STATUS_BTRL_MASK)

#define ENET_QOS_MTL_EST_STATUS_CGSN_MASK        (0xF0000U)
#define ENET_QOS_MTL_EST_STATUS_CGSN_SHIFT       (16U)
/*! CGSN - Current GCL Slot Number Indicates the slot number of the GCL list. */
#define ENET_QOS_MTL_EST_STATUS_CGSN(x)          (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_EST_STATUS_CGSN_SHIFT)) & ENET_QOS_MTL_EST_STATUS_CGSN_MASK)
/*! @} */

/*! @name MTL_EST_SCH_ERROR - EST Scheduling Error */
/*! @{ */

#define ENET_QOS_MTL_EST_SCH_ERROR_SEQN_MASK     (0x1FU)
#define ENET_QOS_MTL_EST_SCH_ERROR_SEQN_SHIFT    (0U)
/*! SEQN - Schedule Error Queue Number The One Hot Encoded Queue Numbers that have experienced
 *    error/timeout described in HLBS field of status register.
 */
#define ENET_QOS_MTL_EST_SCH_ERROR_SEQN(x)       (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_EST_SCH_ERROR_SEQN_SHIFT)) & ENET_QOS_MTL_EST_SCH_ERROR_SEQN_MASK)
/*! @} */

/*! @name MTL_EST_FRM_SIZE_ERROR - EST Frame Size Error */
/*! @{ */

#define ENET_QOS_MTL_EST_FRM_SIZE_ERROR_FEQN_MASK (0x1FU)
#define ENET_QOS_MTL_EST_FRM_SIZE_ERROR_FEQN_SHIFT (0U)
/*! FEQN - Frame Size Error Queue Number The One Hot Encoded Queue Numbers that have experienced
 *    error described in HLBF field of status register.
 */
#define ENET_QOS_MTL_EST_FRM_SIZE_ERROR_FEQN(x)  (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_EST_FRM_SIZE_ERROR_FEQN_SHIFT)) & ENET_QOS_MTL_EST_FRM_SIZE_ERROR_FEQN_MASK)
/*! @} */

/*! @name MTL_EST_FRM_SIZE_CAPTURE - EST Frame Size Capture */
/*! @{ */

#define ENET_QOS_MTL_EST_FRM_SIZE_CAPTURE_HBFS_MASK (0x7FFFU)
#define ENET_QOS_MTL_EST_FRM_SIZE_CAPTURE_HBFS_SHIFT (0U)
/*! HBFS - Frame Size of HLBF Captures the Frame Size of the dropped frame related to queue number
 *    indicated in HBFQ field of this register.
 */
#define ENET_QOS_MTL_EST_FRM_SIZE_CAPTURE_HBFS(x) (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_EST_FRM_SIZE_CAPTURE_HBFS_SHIFT)) & ENET_QOS_MTL_EST_FRM_SIZE_CAPTURE_HBFS_MASK)

#define ENET_QOS_MTL_EST_FRM_SIZE_CAPTURE_HBFQ_MASK (0x70000U)
#define ENET_QOS_MTL_EST_FRM_SIZE_CAPTURE_HBFQ_SHIFT (16U)
/*! HBFQ - Queue Number of HLBF Captures the binary value of the of the first Queue (number)
 *    experiencing HLBF error (see HLBF field of status register).
 */
#define ENET_QOS_MTL_EST_FRM_SIZE_CAPTURE_HBFQ(x) (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_EST_FRM_SIZE_CAPTURE_HBFQ_SHIFT)) & ENET_QOS_MTL_EST_FRM_SIZE_CAPTURE_HBFQ_MASK)
/*! @} */

/*! @name MTL_EST_INTR_ENABLE - EST Interrupt Enable */
/*! @{ */

#define ENET_QOS_MTL_EST_INTR_ENABLE_IECC_MASK   (0x1U)
#define ENET_QOS_MTL_EST_INTR_ENABLE_IECC_SHIFT  (0U)
/*! IECC - Interrupt Enable for Switch List When set, generates interrupt when the configuration
 *    change is successful and the hardware has switched to the new list.
 *  0b0..Interrupt for Switch List is disabled
 *  0b1..Interrupt for Switch List is enabled
 */
#define ENET_QOS_MTL_EST_INTR_ENABLE_IECC(x)     (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_EST_INTR_ENABLE_IECC_SHIFT)) & ENET_QOS_MTL_EST_INTR_ENABLE_IECC_MASK)

#define ENET_QOS_MTL_EST_INTR_ENABLE_IEBE_MASK   (0x2U)
#define ENET_QOS_MTL_EST_INTR_ENABLE_IEBE_SHIFT  (1U)
/*! IEBE - Interrupt Enable for BTR Error When set, generates interrupt when the BTR Error occurs and is indicated in the status.
 *  0b0..Interrupt for BTR Error is disabled
 *  0b1..Interrupt for BTR Error is enabled
 */
#define ENET_QOS_MTL_EST_INTR_ENABLE_IEBE(x)     (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_EST_INTR_ENABLE_IEBE_SHIFT)) & ENET_QOS_MTL_EST_INTR_ENABLE_IEBE_MASK)

#define ENET_QOS_MTL_EST_INTR_ENABLE_IEHF_MASK   (0x4U)
#define ENET_QOS_MTL_EST_INTR_ENABLE_IEHF_SHIFT  (2U)
/*! IEHF - Interrupt Enable for HLBF When set, generates interrupt when the Head-of-Line Blocking
 *    due to Frame Size error occurs and is indicated in the status.
 *  0b0..Interrupt for HLBF is disabled
 *  0b1..Interrupt for HLBF is enabled
 */
#define ENET_QOS_MTL_EST_INTR_ENABLE_IEHF(x)     (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_EST_INTR_ENABLE_IEHF_SHIFT)) & ENET_QOS_MTL_EST_INTR_ENABLE_IEHF_MASK)

#define ENET_QOS_MTL_EST_INTR_ENABLE_IEHS_MASK   (0x8U)
#define ENET_QOS_MTL_EST_INTR_ENABLE_IEHS_SHIFT  (3U)
/*! IEHS - Interrupt Enable for HLBS When set, generates interrupt when the Head-of-Line Blocking
 *    due to Scheduling issue and is indicated in the status.
 *  0b0..Interrupt for HLBS is disabled
 *  0b1..Interrupt for HLBS is enabled
 */
#define ENET_QOS_MTL_EST_INTR_ENABLE_IEHS(x)     (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_EST_INTR_ENABLE_IEHS_SHIFT)) & ENET_QOS_MTL_EST_INTR_ENABLE_IEHS_MASK)

#define ENET_QOS_MTL_EST_INTR_ENABLE_CGCE_MASK   (0x10U)
#define ENET_QOS_MTL_EST_INTR_ENABLE_CGCE_SHIFT  (4U)
/*! CGCE - Interrupt Enable for CGCE When set, generates interrupt when the Constant Gate Control
 *    Error occurs and is indicated in the status.
 *  0b0..Interrupt for CGCE is disabled
 *  0b1..Interrupt for CGCE is enabled
 */
#define ENET_QOS_MTL_EST_INTR_ENABLE_CGCE(x)     (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_EST_INTR_ENABLE_CGCE_SHIFT)) & ENET_QOS_MTL_EST_INTR_ENABLE_CGCE_MASK)
/*! @} */

