Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1150/periph/PERI_ENET_QOS.h
#define ENET_QOS_DMA_DEBUG_STATUS0_TPS2_MASK     (0xF0000000U)
#define ENET_QOS_DMA_DEBUG_STATUS0_TPS2_SHIFT    (28U)
/*! TPS2 - DMA Channel 2 Transmit Process State This field indicates the Tx DMA FSM state for Channel 2.
 *  0b0000..Stopped (Reset or Stop Transmit Command issued)
 *  0b0001..Running (Fetching Tx Transfer Descriptor)
 *  0b0010..Running (Waiting for status)
 *  0b0011..Running (Reading Data from system memory buffer and queuing it to the Tx buffer (Tx FIFO))
 *  0b0100..Timestamp write state
 *  0b0101..Reserved for future use
 *  0b0110..Suspended (Tx Descriptor Unavailable or Tx Buffer Underflow)
 *  0b0111..Running (Closing Tx Descriptor)
 */
#define ENET_QOS_DMA_DEBUG_STATUS0_TPS2(x)       (((uint32_t)(((uint32_t)(x)) << ENET_QOS_DMA_DEBUG_STATUS0_TPS2_SHIFT)) & ENET_QOS_DMA_DEBUG_STATUS0_TPS2_MASK)
/*! @} */

/*! @name DMA_DEBUG_STATUS1 - DMA Debug Status 1 */
/*! @{ */

#define ENET_QOS_DMA_DEBUG_STATUS1_RPS3_MASK     (0xFU)
#define ENET_QOS_DMA_DEBUG_STATUS1_RPS3_SHIFT    (0U)
/*! RPS3 - DMA Channel 3 Receive Process State This field indicates the Rx DMA FSM state for Channel 3.
 *  0b0000..Stopped (Reset or Stop Receive Command issued)
 *  0b0001..Running (Fetching Rx Transfer Descriptor)
 *  0b0010..Reserved for future use
 *  0b0011..Running (Waiting for Rx packet)
 *  0b0100..Suspended (Rx Descriptor Unavailable)
 *  0b0101..Running (Closing the Rx Descriptor)
 *  0b0110..Timestamp write state
 *  0b0111..Running (Transferring the received packet data from the Rx buffer to the system memory)
 */
#define ENET_QOS_DMA_DEBUG_STATUS1_RPS3(x)       (((uint32_t)(((uint32_t)(x)) << ENET_QOS_DMA_DEBUG_STATUS1_RPS3_SHIFT)) & ENET_QOS_DMA_DEBUG_STATUS1_RPS3_MASK)

#define ENET_QOS_DMA_DEBUG_STATUS1_TPS3_MASK     (0xF0U)
#define ENET_QOS_DMA_DEBUG_STATUS1_TPS3_SHIFT    (4U)
/*! TPS3 - DMA Channel 3 Transmit Process State This field indicates the Tx DMA FSM state for Channel 3.
 *  0b0000..Stopped (Reset or Stop Transmit Command issued)
 *  0b0001..Running (Fetching Tx Transfer Descriptor)
 *  0b0010..Running (Waiting for status)
 *  0b0011..Running (Reading Data from system memory buffer and queuing it to the Tx buffer (Tx FIFO))
 *  0b0100..Timestamp write state
 *  0b0101..Reserved for future use
 *  0b0110..Suspended (Tx Descriptor Unavailable or Tx Buffer Underflow)
 *  0b0111..Running (Closing Tx Descriptor)
 */
#define ENET_QOS_DMA_DEBUG_STATUS1_TPS3(x)       (((uint32_t)(((uint32_t)(x)) << ENET_QOS_DMA_DEBUG_STATUS1_TPS3_SHIFT)) & ENET_QOS_DMA_DEBUG_STATUS1_TPS3_MASK)

#define ENET_QOS_DMA_DEBUG_STATUS1_RPS4_MASK     (0xF00U)
#define ENET_QOS_DMA_DEBUG_STATUS1_RPS4_SHIFT    (8U)
/*! RPS4 - DMA Channel 4 Receive Process State This field indicates the Rx DMA FSM state for Channel 4.
 *  0b0000..Stopped (Reset or Stop Receive Command issued)
 *  0b0001..Running (Fetching Rx Transfer Descriptor)
 *  0b0010..Reserved for future use
 *  0b0011..Running (Waiting for Rx packet)
 *  0b0100..Suspended (Rx Descriptor Unavailable)
 *  0b0101..Running (Closing the Rx Descriptor)
 *  0b0110..Timestamp write state
 *  0b0111..Running (Transferring the received packet data from the Rx buffer to the system memory)
 */
#define ENET_QOS_DMA_DEBUG_STATUS1_RPS4(x)       (((uint32_t)(((uint32_t)(x)) << ENET_QOS_DMA_DEBUG_STATUS1_RPS4_SHIFT)) & ENET_QOS_DMA_DEBUG_STATUS1_RPS4_MASK)

#define ENET_QOS_DMA_DEBUG_STATUS1_TPS4_MASK     (0xF000U)
#define ENET_QOS_DMA_DEBUG_STATUS1_TPS4_SHIFT    (12U)
/*! TPS4 - DMA Channel 4 Transmit Process State This field indicates the Tx DMA FSM state for Channel 4.
 *  0b0000..Stopped (Reset or Stop Transmit Command issued)
 *  0b0001..Running (Fetching Tx Transfer Descriptor)
 *  0b0010..Running (Waiting for status)
 *  0b0011..Running (Reading Data from system memory buffer and queuing it to the Tx buffer (Tx FIFO))
 *  0b0100..Timestamp write state
 *  0b0101..Reserved for future use
 *  0b0110..Suspended (Tx Descriptor Unavailable or Tx Buffer Underflow)
 *  0b0111..Running (Closing Tx Descriptor)
 */
#define ENET_QOS_DMA_DEBUG_STATUS1_TPS4(x)       (((uint32_t)(((uint32_t)(x)) << ENET_QOS_DMA_DEBUG_STATUS1_TPS4_SHIFT)) & ENET_QOS_DMA_DEBUG_STATUS1_TPS4_MASK)
/*! @} */

/*! @name DMA_AXI_LPI_ENTRY_INTERVAL - AXI LPI Entry Interval Control */
/*! @{ */

#define ENET_QOS_DMA_AXI_LPI_ENTRY_INTERVAL_LPIEI_MASK (0xFU)
#define ENET_QOS_DMA_AXI_LPI_ENTRY_INTERVAL_LPIEI_SHIFT (0U)
/*! LPIEI - LPI Entry Interval Contains the number of system clock cycles, multiplied by 64, to wait
 *    for an activity in the DWC_ether_qos to enter into the AXI low power state 0 indicates 64
 *    clock cycles
 */
#define ENET_QOS_DMA_AXI_LPI_ENTRY_INTERVAL_LPIEI(x) (((uint32_t)(((uint32_t)(x)) << ENET_QOS_DMA_AXI_LPI_ENTRY_INTERVAL_LPIEI_SHIFT)) & ENET_QOS_DMA_AXI_LPI_ENTRY_INTERVAL_LPIEI_MASK)
/*! @} */

/*! @name DMA_TBS_CTRL0 - DMA_TBS_CTRL0 */
/*! @{ */

#define ENET_QOS_DMA_TBS_CTRL0_FTOV_MASK         (0x1U)
#define ENET_QOS_DMA_TBS_CTRL0_FTOV_SHIFT        (0U)
/*! FTOV - Fetch Time Offset Valid When set indicates the FTOS field is valid. When not set,
 *    indicates the Fetch Offset is not valid and the DMA engine can fetch the frames from host memory
 *    without any time restrictions.
 *  0b0..Fetch Time Offset is invalid
 *  0b1..Fetch Time Offset is valid
 */
#define ENET_QOS_DMA_TBS_CTRL0_FTOV(x)           (((uint32_t)(((uint32_t)(x)) << ENET_QOS_DMA_TBS_CTRL0_FTOV_SHIFT)) & ENET_QOS_DMA_TBS_CTRL0_FTOV_MASK)

#define ENET_QOS_DMA_TBS_CTRL0_FGOS_MASK         (0x70U)
#define ENET_QOS_DMA_TBS_CTRL0_FGOS_SHIFT        (4U)
/*! FGOS - Fetch GSN Offset */
#define ENET_QOS_DMA_TBS_CTRL0_FGOS(x)           (((uint32_t)(((uint32_t)(x)) << ENET_QOS_DMA_TBS_CTRL0_FGOS_SHIFT)) & ENET_QOS_DMA_TBS_CTRL0_FGOS_MASK)

#define ENET_QOS_DMA_TBS_CTRL0_FTOS_MASK         (0xFFFFFF00U)
#define ENET_QOS_DMA_TBS_CTRL0_FTOS_SHIFT        (8U)
/*! FTOS - Fetch Time Offset */
#define ENET_QOS_DMA_TBS_CTRL0_FTOS(x)           (((uint32_t)(((uint32_t)(x)) << ENET_QOS_DMA_TBS_CTRL0_FTOS_SHIFT)) & ENET_QOS_DMA_TBS_CTRL0_FTOS_MASK)
/*! @} */

/*! @name DMA_TBS_CTRL1 - DMA_TBS_CTRL1 */
/*! @{ */

#define ENET_QOS_DMA_TBS_CTRL1_FTOV_MASK         (0x1U)
#define ENET_QOS_DMA_TBS_CTRL1_FTOV_SHIFT        (0U)
/*! FTOV - Fetch Time Offset Valid When set indicates the FTOS field is valid. When not set,
 *    indicates the Fetch Offset is not valid and the DMA engine can fetch the frames from host memory
 *    without any time restrictions.
 *  0b0..Fetch Time Offset is invalid
 *  0b1..Fetch Time Offset is valid
 */
#define ENET_QOS_DMA_TBS_CTRL1_FTOV(x)           (((uint32_t)(((uint32_t)(x)) << ENET_QOS_DMA_TBS_CTRL1_FTOV_SHIFT)) & ENET_QOS_DMA_TBS_CTRL1_FTOV_MASK)

